Tekla Open API Reference for Tekla Structures 2025
GridCylindricalSurface.CylinderBase Property
 The arc that represents the base of the cylindrical surface. The cylinder is then extruded along the normal direction of the arc, with the height given by CylinderHeight"
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Arc CylinderBase { get; set; }
Public Property CylinderBase As Arc
	Get
	Set
Property Value
Type: Arc
See Also
Reference
GridCylindricalSurface Class
Tekla.Structures.Model Namespace